zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PHY_CTRL_EX.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_PHY_CTRL_EX.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_PHY_CTRL_EX
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_PHY_CTRL_EX_H_)  /* Check if memory map has not been already included */
#define S32K566_PHY_CTRL_EX_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- PHY_CTRL_EX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PHY_CTRL_EX_Peripheral_Access_Layer PHY_CTRL_EX Peripheral Access Layer
 * @{
 */

/** PHY_CTRL_EX - Register Layout Typedef */
typedef struct PHY_CTRL_EX_Struct {
  uint8_t RESERVED_0[276];
  __IO uint16_t GLOBAL_CTRL_EX_0;                  /**< PHY Global extra control register, offset: 0x114 */
  uint8_t RESERVED_1[2];
  __IO uint16_t GLOBAL_CTRL_EX_1;                  /**< PHY Global extra control register, offset: 0x118 */
  uint8_t RESERVED_2[2];
  __IO uint16_t GLOBAL_CTRL_EX_2;                  /**< PHY Global extra control register, offset: 0x11C */
  uint8_t RESERVED_3[2];
  __IO uint16_t GLOBAL_CTRL_EX_3;                  /**< PHY Global extra control register, offset: 0x120 */
  uint8_t RESERVED_4[2];
  __IO uint16_t GLOBAL_CTRL_EX_4;                  /**< PHY Global extra control register, offset: 0x124 */
  uint8_t RESERVED_5[2];
  __IO uint16_t GLOBAL_CTRL_EX_5;                  /**< PHY Global extra control register, offset: 0x128 */
  uint8_t RESERVED_6[130946];
  __IO uint16_t MPLLA_CTRL_EX_0;                   /**< MPLLA extra control register, offset: 0x200AC */
  uint8_t RESERVED_7[2];
  __IO uint16_t MPLLA_CTRL_EX_1;                   /**< MPLLA extra control register, offset: 0x200B0 */
  uint8_t RESERVED_8[2];
  __IO uint16_t MPLLA_CTRL_EX_2;                   /**< MPLLA extra control register, offset: 0x200B4 */
  uint8_t RESERVED_9[131062];
  __IO uint16_t MPLLB_CTRL_EX_0;                   /**< MPLLB extra control register, offset: 0x400AC */
  uint8_t RESERVED_10[2];
  __IO uint16_t MPLLB_CTRL_EX_1;                   /**< MPLLB extra control register, offset: 0x400B0 */
  uint8_t RESERVED_11[2];
  __IO uint16_t MPLLB_CTRL_EX_2;                   /**< MPLLB extra control register, offset: 0x400B4 */
  uint8_t RESERVED_12[132434];
  __IO uint16_t LANE0_CTRL_EX_0;                   /**< LANE0 extra control register, offset: 0x60608 */
  uint8_t RESERVED_13[2];
  __IO uint16_t LANE0_CTRL_EX_1;                   /**< LANE0 extra control register, offset: 0x6060C */
  uint8_t RESERVED_14[2];
  __IO uint16_t LANE0_CTRL_EX_2;                   /**< LANE0 extra control register, offset: 0x60610 */
  uint8_t RESERVED_15[2];
  __IO uint16_t LANE0_CTRL_EX_3;                   /**< LANE0 extra control register, offset: 0x60614 */
  uint8_t RESERVED_16[2];
  __IO uint16_t LANE0_CTRL_EX_4;                   /**< LANE0 extra control register, offset: 0x60618 */
  uint8_t RESERVED_17[2];
  __IO uint16_t MAC_ADAPTER_0_ERROR_EVENT;         /**< Error Event for FIFO, offset: 0x6061C */
} PHY_CTRL_EX_Type, *PHY_CTRL_EX_MemMapPtr;

/** Number of instances of the PHY_CTRL_EX module. */
#define PHY_CTRL_EX_INSTANCE_COUNT               (1u)

/* PHY_CTRL_EX - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX_BASE (0xC00000u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX ((PHY_CTRL_EX_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX_BASE)
/** Array initializer of PHY_CTRL_EX peripheral base addresses */
#define IP_PHY_CTRL_EX_BASE_ADDRS                { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX_BASE }
/** Array initializer of PHY_CTRL_EX peripheral base pointers */
#define IP_PHY_CTRL_EX_BASE_PTRS                 { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__PHY_CTRL_EX }

/* ----------------------------------------------------------------------------
   -- PHY_CTRL_EX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PHY_CTRL_EX_Register_Masks PHY_CTRL_EX Register Masks
 * @{
 */

/*! @name GLOBAL_CTRL_EX_0 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS_MASK (0x1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS_SHIFT (0U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SRAM_BYPASS_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL_MASK (0x10U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL_SHIFT (4U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS0_SEL_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL_MASK (0x20U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL_SHIFT (5U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_XPCS1_SEL_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL_MASK (0x40U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL_SHIFT (6U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLA_SEL_MASK)

