zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PHY_CTRL_EX.h
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL_MASK (0x80U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL_SHIFT (7U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_MPLLB_SEL_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC_MASK (0xFF00U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC_SHIFT (8U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC_WIDTH (8U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_0_PHY_SUP_MISC_MASK)
/*! @} */

/*! @name GLOBAL_CTRL_EX_1 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN_MASK (0x1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN_SHIFT (0U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_FLYOVER_EN_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN_MASK (0x10U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN_SHIFT (4U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_1_PHY_TEST_STOP_CLK_EN_MASK)
/*! @} */

/*! @name GLOBAL_CTRL_EX_2 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET_MASK (0x1FFU)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET_SHIFT (0U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET_WIDTH (9U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_2_PHY_TXDN_TERM_OFFSET_MASK)
/*! @} */

/*! @name GLOBAL_CTRL_EX_3 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET_MASK (0x1FFU)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET_SHIFT (0U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET_WIDTH (9U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_3_PHY_TXUP_TERM_OFFSET_MASK)
/*! @} */

/*! @name GLOBAL_CTRL_EX_4 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE_MASK (0x100U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE_SHIFT (8U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PCS_PWR_STABLE_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN_MASK (0x400U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN_SHIFT (10U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_MODE_EN_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET_MASK (0x1000U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET_SHIFT (12U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PG_RESET_MASK)

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE_MASK (0x4000U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE_SHIFT (14U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_4_PHY_PMA_PWR_STABLE_MASK)
/*! @} */

/*! @name GLOBAL_CTRL_EX_5 - PHY Global extra control register */
/*! @{ */

#define PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN_MASK (0x1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN_SHIFT (0U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN_WIDTH (1U)
#define PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN_SHIFT)) & PHY_CTRL_EX_GLOBAL_CTRL_EX_5_PHY_REF_CLKDET_EN_MASK)
/*! @} */

/*! @name MPLLA_CTRL_EX_0 - MPLLA extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN_MASK (0x1U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN_SHIFT (0U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN_WIDTH (1U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_FORCE_EN_MASK)

#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL_MASK (0x6U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL_SHIFT (1U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL_WIDTH (2U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_RECAL_BANK_SEL_MASK)

#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV_MASK (0x18U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV_SHIFT (3U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV_WIDTH (2U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_0_PHY_MPLLA_TX_CLK_DIV_MASK)

#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER_MASK (0xF00U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER_SHIFT (8U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER_WIDTH (4U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_0_MPLLA_CFG_DRIVER_MASK)

#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI_MASK  (0xF000U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI_SHIFT (12U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI_WIDTH (4U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI(x)    (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_0_WHOAMI_MASK)
/*! @} */

/*! @name MPLLA_CTRL_EX_1 - MPLLA extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT_MASK (0xFFFU)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT_SHIFT (0U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT_WIDTH (12U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_1_PHY_MPLLA_SSC_FREQ_CNT_INIT_MASK)
/*! @} */

/*! @name MPLLA_CTRL_EX_2 - MPLLA extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK_MASK (0xFFU)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK_SHIFT (0U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK_WIDTH (8U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_FREQ_CNT_PEAK_MASK)

