zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PHY_CTRL_EX.h
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD_MASK (0x100U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD_SHIFT (8U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD_WIDTH (1U)
#define PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD_SHIFT)) & PHY_CTRL_EX_MPLLA_CTRL_EX_2_PHY_MPLLA_SSC_UP_SPREAD_MASK)
/*! @} */

/*! @name MPLLB_CTRL_EX_0 - MPLLB extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN_MASK (0x1U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN_SHIFT (0U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN_WIDTH (1U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_FORCE_EN_MASK)

#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL_MASK (0x6U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL_SHIFT (1U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL_WIDTH (2U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_RECAL_BANK_SEL_MASK)

#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV_MASK (0x18U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV_SHIFT (3U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV_WIDTH (2U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_0_PHY_MPLLB_TX_CLK_DIV_MASK)

#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER_MASK (0xF00U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER_SHIFT (8U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER_WIDTH (4U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_0_MPLLB_CFG_DRIVER_MASK)

#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI_MASK  (0xF000U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI_SHIFT (12U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI_WIDTH (4U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI(x)    (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_0_WHOAMI_MASK)
/*! @} */

/*! @name MPLLB_CTRL_EX_1 - MPLLB extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT_MASK (0xFFFU)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT_SHIFT (0U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT_WIDTH (12U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_1_PHY_MPLLB_SSC_FREQ_CNT_INIT_MASK)
/*! @} */

/*! @name MPLLB_CTRL_EX_2 - MPLLB extra control register */
/*! @{ */

#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK_MASK (0xFFU)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK_SHIFT (0U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK_WIDTH (8U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_FREQ_CNT_PEAK_MASK)

#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD_MASK (0x100U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD_SHIFT (8U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD_WIDTH (1U)
#define PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD_SHIFT)) & PHY_CTRL_EX_MPLLB_CTRL_EX_2_PHY_MPLLB_SSC_UP_SPREAD_MASK)
/*! @} */

/*! @name LANE0_CTRL_EX_0 - LANE0 extra control register */
/*! @{ */

#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG_MASK (0x1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG_SHIFT (0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_IN_PROG_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE_MASK (0x30U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE_SHIFT (4U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE_WIDTH (2U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_MODE_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL_MASK (0x100U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL_SHIFT (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_0_PHY_RX_ADAPT_SEL_MASK)
/*! @} */

/*! @name LANE0_CTRL_EX_1 - LANE0 extra control register */
/*! @{ */

#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX_MASK (0x1FU)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX_SHIFT (0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX_WIDTH (5U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_PPM_MAX_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND_MASK (0xC0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND_SHIFT (6U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND_WIDTH (2U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_FREQBAND_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL_MASK (0x100U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL_SHIFT (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_STEP_CTRL_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN_MASK (0x1000U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN_SHIFT (12U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_1_PHY_RX_CDR_VCO_TEMP_COMP_EN_MASK)
/*! @} */

/*! @name LANE0_CTRL_EX_2 - LANE0 extra control register */
/*! @{ */

#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ_MASK (0xFU)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ_SHIFT (0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ_WIDTH (4U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DELTA_IQ_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS_MASK (0x10U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS_SHIFT (4U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_DFE_BYPASS_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ_MASK (0x7F00U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ_SHIFT (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ_WIDTH (7U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_2_PHY_RX_MARGIN_IQ_MASK)
/*! @} */

/*! @name LANE0_CTRL_EX_3 - LANE0 extra control register */
/*! @{ */

#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET_MASK (0x1FU)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET_SHIFT (0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET_WIDTH (5U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_TERM_OFFSET_MASK)

