zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PHY_CTRL_EX.h
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC_MASK (0xFF00U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC_SHIFT (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC_WIDTH (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_3_PHY_RX_MISC_MASK)
/*! @} */

/*! @name LANE0_CTRL_EX_4 - LANE0 extra control register */
/*! @{ */

#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT_MASK (0x1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT_SHIFT (0U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT_WIDTH (1U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX0_INVERT_MASK)

#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC_MASK (0xFF00U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC_SHIFT (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC_WIDTH (8U)
#define PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC_SHIFT)) & PHY_CTRL_EX_LANE0_CTRL_EX_4_PHY_TX_MISC_MASK)
/*! @} */

/*! @name MAC_ADAPTER_0_ERROR_EVENT - Error Event for FIFO */
/*! @{ */

#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF_MASK (0x1U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF_SHIFT (0U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF_WIDTH (1U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF_SHIFT)) & PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_RX_FIFO_OVF_MASK)

#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF_MASK (0x10U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF_SHIFT (4U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF_WIDTH (1U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF_SHIFT)) & PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_SGMII_TX_FIFO_UDF_MASK)

#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST_MASK (0x100U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST_SHIFT (8U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST_WIDTH (1U)
#define PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST(x) (((uint16_t)(((uint16_t)(x)) << PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST_SHIFT)) & PHY_CTRL_EX_MAC_ADAPTER_0_ERROR_EVENT_MAC_SOFT_RST_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group PHY_CTRL_EX_Register_Masks */

/*!
 * @}
 */ /* end of group PHY_CTRL_EX_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_PHY_CTRL_EX_H_) */
